---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RevitLinkOperations
source: html/442149fc-b0d0-c839-9d7a-07ba46c198de.htm
---
# RevitLinkOperations Members

Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links
 obtained from an IExternalResourceServer.